[
  {
    "title": "Black Bean Tacos",
    "tags": "Spicy, Mexican, Fav",
    "ingrediants":
      "2 (14.5 oz) cans black beans, drained and rinsed\n1 cup store-bought refrigerated tomato based salsa* or left-over homemade salsa\n1 1/2 tsp chili powder\n1 tsp ground cumin\nSalt and freshly ground black pepper\n1/2 medium avocado\n1/2 cup plain Greek yogurt\n1 cup fresh cilantro**\n1 Tbsp lime juice , or more to taste\n1 clove garlic , pressed through a garlic crusher",
    "directions":
      "In a medium saucepan combine black beans, salsa, chili powder and cumin. Simmer mixture for about 5 -10 minutes, stirring occasionally. Slightly mash beans if desired.\n\nMeanwhile in a food processor pulse together avocado, Greek yogurt, cilantro, lime juice and garlic until cilantro is finely minced. Season with salt and pepper to taste (if you want the sauce thinner you can add in 1 Tbsp water).\n\nTo assemble tacos, on each tortilla layer black bean mixture, avocado cilantro lime crema, lettuce, cheese and tomatoes. Serve immediately.\n\n*This can be found in the produce section or in the refrigerated latin foods section of the grocery store. If using homemade use one that includes tomatoes, onions, cilantro and garlic.\n\n**This is about the top 1/3 portion of one medium bunch of cilantro, so use mostly leaves and some stem."
  },
  {
    "title": "Fish Tacos",
    "tags": "Tacos, Mexican, fish",
    "ingrediants":
      "3 tbsp. extra-virgin olive oil\nJuice of 1 lime\n2 tsp. chili powder\n1/2 tsp. ground cumin\n1/2 tsp. cayenne pepper\n1 1/2 lb. cod (or other flaky white fish)\n1/2 tbsp. vegetable oil\nkosher salt\nFreshly ground black pepper\n8 corn tortillas\n1 avocado, cubed\nLime wedges, for serving\nSour cream, for serving\n\nFOR THE CORN SLAW:\n1/4 c. mayonnaise\n2 tbsp. lime juice\n2 tbsp. chopped fresh cilantro\n1 tbsp. honey\n2 c. shredded purple cabbage\n1 c. corn kernels\n1 jalapeño, minced",
    "directions":
      "In a medium shallow bowl, whisk together olive oil, lime juice, chili powder, cumin, and cayenne.\n\nAdd the cod, tossing the filets in the mixture to evenly coat. Let marinate for 15 minutes.\n\nMeanwhile, make the slaw: In a large bowl, whisk together mayonnaise, lime juice, cilantro, and honey. Stir in cabbage, corn and jalapeño. Season with salt and pepper.\n\nIn a large nonstick pan over medium-high heat, heat vegetable oil. Remove the cod from the marinade and season both sides of each filet with salt and pepper. Place the fish on the pan, flesh side down. Cook until the fish is opaque and cooked through, 3 to 5 minutes per side. Let rest for about 5 minutes before flaking the fish with a fork.\n\nAssemble tacos: Serve fish over grilled tortillas with corn slaw and avocado. Squeeze lime juice on top and garnish with sour cream.\n"
  },
  {
    "title": "Grilled Cheese",
    "tags": "American, cheese, quick",
    "ingrediants":
      "2 slices ½”-thick Pullman or other white bread\n2 tablespoons mayonnaise\n1 tablespoon unsalted butter\n2 ounces thinly sliced American cheese or cheddar (about 4 slices)\nFreshly ground black pepper\nCampbell’s Tomato Soup (for serving; optional)",
    "directions":
      "Butter one side of slice of bread\n\nPlace butter-side down in hot skillet\n\ncover top with cheese\n\nPlace another slide of bread on top of the cheese, butter-side up\n\nFlip, and let cook ~3 mins\n\nEat! "
  },
  {
    "title": "Grilled Salmon & Veggies",
    "tags": "Fish, Grill",
    "ingrediants":
      "1.5 lbs Salmon\n3 tbsp melted butter\n1 lemon\n3 cloves garlic\n3 Bell peppers (yellow, green, red)\n1 Purple onion\nSalt\nPepper\n\nOptional\nFrench Bread\nGarlic Salt",
    "directions":
      "Using cooking brush, spread half the melted butter across the top of the fish. Salt and pepper the fish, sprinkle 1 clove diced garlic, and rub into fish. Squeeze 1/4 lemon over the top of the fish. \n\nLet sit for ~30 minutes. \n\nTurn on and clean grill. \n\nRinse and chop bell peppers into ~1 inch pieces, same for purple onion. Spread across a 9x9inch baking glass sheet, drizzle remaining butter over the top, sprinkle remaining garlic (diced) over the top. \n\nOptional: Add quartered small potatoes to peppers and onions. May add additional butter, or olive oil. \n\nBake veggies in oven at 350F for ~35 minutes (+15 minutes with potatoes). \n\nGrease grill. Put fish on, skin up, for 5-7 minutes, then flip to skin down for 10-12 minutes. \n\nServe fish with veggies on the side. Optional, add garlic bread! "
  },
  {
    "title": "Kielbasa & Veggies",
    "tags": "American, Quick",
    "ingrediants":
      "1 Kielbasa\n3 Bell Peppers (green, yellow, red)\n1 Purple Onion\nSpanish Rice mix",
    "directions":
      "Start the rice cooking per the directions on the box. This typically takes the longest, so start here first. \n\nSlice Kielbasa into 1/4\" slices, and toss into a hot skillet with 1tbsp butter. Cook 5-8 minutes under medium heat. \n\nMeanwhile, slice bell peppers into large bite-size chunks. Slice onion in similar way, and add both to the pan. Cook under medium heat for ~10 minutes. \n\nWhen rice is done, serve both rice and kielbasa veggie mixture together!"
  },
  {
    "title": "Pasta Salad",
    "tags": "Pasta, Summer",
    "ingrediants":
      "1 (1 lb) box tri-colored pasta\n2 cups chopped green peppers\n2 cups diced tomatoes\n1 1⁄2 cups chopped red onions\n1⁄2 lb cubed provolone cheese (optional)\n1⁄2 lb sliced pepperoni\n1⁄2 cup sliced black olives\nDRESSING\n3⁄4 cup pompeian extra virgin olive oil\n3⁄4 cup pompeian red wine vinegar (this brand is excellent in this dish)\n1⁄4 cup sugar\n1 tablespoon oregano\n1 teaspoon salt\n1⁄2 teaspoon pepper",
    "directions":
      "Mix together dressing first and set aside until sugar is dissolved completely.\n\nCook pasta according to box directions and rinse under cold water until cool.\n\nSlice the sliced pepperoni circles in half and separate slices.\n\nMix together with pasta and chopped items, except the provolone cheese.\n\nPour dressing over it all and mix well.\n\nChill well.\n\nAdd provolone cheese to salad before serving, otherwise it gets soggy.\n\nYou may have to add extra red wine vinegar or olive oil to get it to the desired consistency.\n\nThis is guaranteed not to last long before it is completely devoured!\nEnjoy!"
  },
  {
    "title": "Sesame Beef Stir Fry",
    "tags": "Asian, Beef",
    "ingrediants":
      "BEEF MARINADE\n2 tsp minced garlic\n1 Tbsp grated fresh ginger\n2 Tbsp reduced sodium soy sauce\n1 Tbsp rice vinegar\n1 Tbsp sesame oil\n1 Tbsp sesame seeds\n1/2 tsp Chinese 5 spice\n1/4 tsp black pepper\n\nSTIR FRY\n1 lb flank steak, thinly sliced\n1 cup snow peas, sliced in half across\n1/2 cup sliced carrots\n8 green onions, sliced\n1/4 cup beef broth\n2 Tbsp reduced sodium soy sauce\n1-2 Tbsp honey or light brown sugar\n1 Tbsp rice vinegar\n1/2 Tbsp minced garlic\n2 tsp sesame oil\n1 tsp grated fresh ginger\n1 tsp cornstarch\n1/2 tsp red pepper flakes\n2 Tbsp vegetable oil (for cooking)",
    "directions":
      "Combine marinade ingredients in bowl and add flank steak.  Set aside 15 minutes.\n\nHeat 1 Tbsp vegetable oil in large skillet over MED HIGH heat.  Remove excess marinade from steak and cook in a single layer, for 2-3 minutes, stirring to cook both sides.  Depending on the size of your pan, you may need to do this in batches.  Remove steak to plate.\n\nHeat remaining 1 Tbsp vegetable oil, then add peas, carrots and green onion and cook stirring often, 2-3 minutes.  \n\nWhisk together broth, soy sauce, honey/brown sugar, rice vinegar, garlic, sesame oil, fresh ginger, cornstarch, and red pepper flakes.  Add steak and sauce to skillet, stirring to combine.  Sauce will thicken.\n\nStir in cooked ramen noodles if using, and serve!"
  },
  {
    "title": "Spaghetti alla Carbonara",
    "tags": "Italian, Bacon, Quick",
    "ingrediants":
      "1 Tbsp olive oil or unsalted butter\n1/2 pound pancetta or thick cut bacon, diced\n1-2 garlic cloves, minced, about 1 teaspoon (optional)\n3-4 whole eggs\n1 cup grated parmesan or pecorino cheese\n1 pound spaghetti pasta (or bucatini or fettuccine)\nSalt and black pepper to taste",
    "directions":
      "1 Heat pasta water: Put a large pot of salted water on to boil (1 Tbsp salt for every 2 quarts of water.)\n\n2 Sauté pancetta/bacon and garlic: While the water is coming to a boil, heat the olive oil in a large sauté pan over medium heat. Add the bacon or pancetta and cook slowly until crispy. Add the garlic (if using) and cook another minute, then turn off the heat and put the pancetta and garlic into a large bowl.\n\n3 Beat eggs and half of the cheese: In a small bowl, beat the eggs and mix in about half of the cheese.\n\n4 Cook pasta: Once the water has reached a rolling boil, add the dry pasta, and cook, uncovered, at a rolling boil.\n\n5 Toss pasta with pancetta/bacon: When the pasta is al dente (still a little firm, not mushy), use tongs to move it to the bowl with the bacon and garlic. Let it be dripping wet. Reserve some of the pasta water.\n\nMove the pasta from the pot to the bowl quickly, as you want the pasta to be hot. It's the heat of the pasta that will heat the eggs sufficiently to create a creamy sauce. Toss everything to combine, allowing the pasta to cool just enough so that it doesn't make the eggs curdle when you mix them in. (That's the tricky part.)\n\n6 Add the beaten egg mixture: Add the beaten eggs with cheese and toss quickly to combine once more. Add salt to taste. Add some pasta water back to the pasta to keep it from drying out."
  },
  {
    "title": "Stuffed Peppers",
    "tags": "Hamburger, Tasty",
    "ingrediants":
      "4 large bell peppers (any color) SAVE $\n1 lb lean (at least 80%) ground beef\n2 tablespoons chopped onion\n1 cup cooked rice SAVE $\n1 teaspoon salt\n1 clove garlic, finely chopped\n1 can (15 oz) Muir Glen™ organic tomato sauce\n3/4 cup shredded mozzarella cheese (3 oz)",
    "directions":
      "1 Cut thin slice from stem end of each bell pepper to remove top of pepper. Remove seeds and membranes; rinse peppers. If necessary, cut thin slice from bottom of each pepper so they stand up straight. In 4-quart Dutch oven, add enough water to cover peppers. Heat to boiling; add peppers. Cook about 2 minutes; drain.\n\n2 In 10-inch skillet, cook beef and onion over medium heat 8 to 10 minutes, stirring occasionally, until beef is brown; drain. Stir in rice, salt, garlic and 1 cup of the tomato sauce; cook until hot.\n\n3 Heat oven to 350°F.\n\n4 Stuff peppers with beef mixture. Stand peppers upright in ungreased 8-inch square glass baking dish. Pour remaining tomato sauce over peppers.\n\n5 Cover tightly with foil. Bake 10 minutes. Uncover and bake about 15 minutes longer or until peppers are tender. Sprinkle with cheese."
  },
  {
    "title": "Vietnamese Pho",
    "tags": "Vietnamese, soup",
    "ingrediants":
      "BROTH\n5 to 6 pounds of beef knuckles or leg bones\n6 quarts cold water\n2 medium onions, quartered\n4-inch piece of fresh ginger, halved lengthwise\n2 cinnamon sticks\n1 tablespoon coriander seeds\n1 tablespoon fennel seeds\n6 star anise\n6 whole cloves\n1 black cardamom pod (see note below)\n1 1/2 tablespoons salt\n1/4 cup fish sauce\n1-inch piece yellow rock sugar (see note below)\n\nASSEMBLY\n1 pound small (1/8-inch wide) dried or fresh “banh pho” noodles (see note)\n1/2 pound raw eye of round, sirloin or tri-tip steak, thinly sliced across the grain (see note)\n1/4 cup thinly sliced onions (see note)\n1/4 cup chopped cilantro leaves\n\nFOR THE TABLE\nSprigs of fresh mint and/or Asian/Thai basil\nBean sprouts\nThinly sliced red chilies (such as Thai bird)\nLime wedges\nFish sauce\nHoisin sauce",
    "directions":
      "Add beef bones to a large pot that will hold at least 10 quarts. Then, cover bones with cold water. Place pot onto high heat and bring to a boil. Boil for 3 to 5 minutes. During this time, impurities and foam (or scum) will be released and rise to the top. Drain bones, discarding the water. Then, rinse bones with warm water and scrub stockpot to remove any residue that has stuck to the sides. Add the bones back to the stockpot and cover with 6 quarts of cold water.\n\nMeanwhile, move an oven rack to a high position then turn broiler to high. Line a baking sheet with aluminum foil. Place quartered onions and halved ginger onto baking sheet then broil for 10 to 15 minutes, turning onions and ginger occasionally so that they become charred or browned on all sides.\n\nAdd cinnamon sticks, coriander seeds, fennel seeds, star anise, cloves and the black cardamom pod to a dry frying pan. Place onto low heat and cook, stirring occasionally until fragrant. About 5 minutes. Place toasted spices into a cotton muslin bag/herb sachet or cheesecloth then tie with butchers twine to seal.\n\nBring stockpot with parboiled bones and water to a boil then lower to a gentle simmer. Add charred onion and ginger as well as the bag or sachet of toasted spices. Add 1 1/2 tablespoons of salt, a 1/4 cup of fish sauce and the rock sugar. Continue to simmer broth, uncovered, for 3 hours. If at any time foam or scum rises to the surface, use a spoon to remove it.\n\nUse tongs or a wide mesh spoon to remove bones, onion and ginger from broth then strain broth through a fine mesh strainer. The broth will have a layer of fat at the the top. There are two ways to remove this. First, if you plan to enjoy the broth now, skim the fat from the top of the broth using a spoon. If you do not mind waiting, you can also pour broth into containers then refrigerate overnight. As the broth cools, the fat will solidify, making it very easy to remove."
  },
  {
    "title": "Zuppa Toscana",
    "tags": "Italian, soup, warm",
    "ingrediants":
      "1 pound Italian sausage (spicy) \n4-6 russet potatoes, cut into bite-sized cubes \n1 onion, chopped \n2 tablespoons garlic, minced \n32 ounces chicken broth \n1/2 bunch kale (or swiss chard), destemmed and cut/torn into bite-sized pieces \n1 cup heavy whipping cream \n2 tablespoons flour \nSalt and pepper to taste \nCayenne pepper to taste \n1/4 cup bacon, cooked and chopped",
    "directions":
      "Step 1\nBrown sausage links in a sauté pan.\n\nStep 2\nCut links in half lengthwise, then cut slices.\n\nStep 3\nPlace sausage, chicken broth, garlic, potatoes and onion in slow cooker. Add just enough water to cover the vegetables and meat.\n\nStep 4\nCook on high 3-4 hours (low 5-6 hours) until potatoes are soft.\n\nStep 5\n30 minutes before serving:\n\nStep 6\nMix flour into cream removing lumps.\n\nStep 7\nAdd cream and kale to the crock pot, stir.\n\nStep 8\nCook on high 30 minutes or until broth thickens slightly.\n\nStep 9\nAdd salt, pepper, and cayenne to taste.\n\nStep 10\nTop with bacon immediately before serving."
  }
]
